<h1>Activity: Introduction to lists and tuples</h1>

## Introduction 

In this lab, you will practice creating, modifying, and working with data structures in Python. This will develop your knowledge of different kinds of data structures and the different operations that you can perform with them to answer questions about the data. This will help you prepare for projects you may encounter where you will need to use data structures to store and keep track of data.

For this activity, you are part of a research team that focuses on air quality, and you have received a few data points collected by the U.S. Environmental Protection Agency (EPA). Your goal is to store and organize this data, so that it can be accessed and updated easily.

In this lab, you'll be working specifically with the state names and county names of places that reported air quality index readings.

## Tips for completing this lab

As you navigate this lab, keep the following tips in mind:

- `### YOUR CODE HERE ###` indicates where you should write code. Be sure to replace this with your own code before running the code cell.
- Feel free to open the hints for additional guidance as you work on each task.
- To enter your answer to a question, double-click the markdown cell to edit. Be sure to replace the "[Double-click to enter your responses here.]" with your own answer.
- You can save your work manually by clicking File and then Save in the menu bar at the top of the notebook.
- You can download your work locally by clicking File and then Download and then specifying your preferred file format in the menu bar at the top of the notebook.

## Task 1: Create lists and use tuples

As you continue your work with the EPA, you want to create an ordered data structure containing pairs of values, which can be iterated over to gain insights from the data.

### 1a: Create lists

You'll work with state names and county names indicated below.

| state_name | county_name |
| --- | --- |
| Arizona | Maricopa |
| California | Alameda |
| California | Sacramento |
| Kentucky | Jefferson |
| Louisiana | East Baton Rouge |

<br/>


*  In this task, assign two variables:

    1. `state_names` - a `list` of each state in the `state_name` column in the table above, in order, as strings
    2. `county_names` - a `list` of each county in the `county_name` column in the table above, in order, as strings

In [10]:
# 1. ### YOUR CODE HERE ###
state_list =["Arizona",'California', 'Califonia','Kentucky','Louisiana']

# 2. ### YOUR CODE HERE ###
county_list=["Maricopa",'Alameda','Sacramento', 'Jefferson','East Baton Rouge']

<details><summary><h4>Hint</h4></summary>

Refer to what you've learned about the syntax for instantiating lists.

</details>

### 1b: Use a loop to combine the lists into a single list of tuples

* Use `state_names` and `county_names` to:
    * Create a new list of tuples, where each tuple contains a pair of state name and county name.
    * Assign the new list to a variable called `state_county_tuples`.
* Print the result

*Expected result:*

```
[OUT] [('Arizona', 'Maricopa'),
       ('California', 'Alameda'),
       ('California', 'Sacramento'),
       ('Kentucky', 'Jefferson'),
       ('Louisiana', 'East Baton Rouge')]
```

In [3]:
### YOUR CODE HERE ###
#places =zip(state_list, county_list)
place_tuple_list=[]
# Use a for loop to pair elements from listA and listB
for i in range(len(state_list)):
    place_tuple_list.append((state_list[i], county_list[i]))
print(place_tuple_list)

[('Arizona', 'Maricopa'), ('California', 'Alameda'), ('Califonia', 'Sacramento'), ('Kentucky', 'Jefferson'), ('Louisiana', 'East Baton Rouge')]

<details><summary><h4>Hint 1</h4></summary>

There are several ways to accomplish this task. One way could involve looping over the elements of each list and, with each iteration, assigning a tuple consisting of `(state_names[i], county_names[i])`, which could then be used to build the `state_county_tuples` list.

</details>

<details><summary><h4>Hint 2</h4></summary>

Use the `len()` function and the `range()` function to generate the appropriate number of iterations for a `for` loop.

</details>

<details><summary><h4>Hint 3</h4></summary>

1. Instantiate `state_county_tuples` as an empty list
2. Write a `for` loop to iterate over `range(len(state_names))`
3. With each iteration, append `(state_names[i], county_names[i])` to `state_county_tuples`

</details>

### 1c: Use the `zip()` function to combine the lists into a single list of tuples

Python has a built-in function to make the above process much easier. It's called the `zip()` function. This function accepts any number of iterable objects as arguments. If the arguments are all of equal length, the function returns an iterator object of tuples, where each tuple contains `element[i]` of each argument.

You can then either loop over the iterator object or pass it to the `list()` function to unpack its values.

Refer to the [zip() Python documentation](https://docs.python.org/3/library/functions.html#zip) for more information.

Here's an example:

In [8]:
# RUN THIS CELL
a = ['a', 'b', 'c']
b = [1, 2, 3]
c = zip(a, b)
print(list(places))
print(c)
print(list(c))

[('Arizona', 'Maricopa'), ('California', 'Alameda'), ('Califonia', 'Sacramento'), ('Kentucky', 'Jefferson'), ('Louisiana', 'East Baton Rouge')]
<zip object at 0x738140519d70>
[('a', 1), ('b', 2), ('c', 3)]

Use the `zip()` function to generate the same output created in Task 1b.

1. Use `state_names` and `county_names` to:
    * Create a new list of tuples, where each tuple contains a pair of state name and county name.
    * Assign the new list to a variable called `state_county_zipped`.
2. Check that `state_county_zipped` is the same as `state_county_tuples`.

In [12]:
# 1. ### YOUR CODE HERE ###
places =zip(state_list, county_list)
if(list(places)==place_tuple_list):
    print ("true")
else:
    print ("false")

# 2. ### YOUR CODE HERE ###
print(list(places))
place_tuple_list

true
[]

[('Arizona', 'Maricopa'),
 ('California', 'Alameda'),
 ('Califonia', 'Sacramento'),
 ('Kentucky', 'Jefferson'),
 ('Louisiana', 'East Baton Rouge')]

In [32]:
cities = ['Paris', 'Lagos', 'Mumbai']
countries = ['France', 'Nigeria', 'India']
state_list =["Arizona",'California', 'Califonia','Kentucky','Louisiana']

# 2. ### YOUR CODE HERE ###
county_list=["Maricopa",'Alameda','Sacramento', 'Jefferson','East Baton Rouge']

zipped_places = zip(state_list, county_list)


print(places)
print("list of the tuple is")
print(list(zipped_places))

list_of_lists_places = [list(t) for t in zipped_places]

<zip object at 0x77828432cc80>
list of the tuple is
[('Arizona', 'Maricopa'), ('California', 'Alameda'), ('Califonia', 'Sacramento'), ('Kentucky', 'Jefferson'), ('Louisiana', 'East Baton Rouge')]

<details><summary><h4>Hint 1</h4></summary>

Refer to the example of the `zip()` function provided above.

</details>

<details><summary><h4>Hint 2</h4></summary>

Don't forget to convert the result of the zip operation to a list.

</details>

<details><summary><h4>Hint 3</h4></summary>

1. Use `list(zip(state_names, county_names))` and assign the result to `state_county_zipped`.

2. Test for equality with `state_county_tuples` using the `==` operator.

</details>

## Task 2: Use list comprehension to convert to list of lists

Since tuples are immutable and can't be changed, converting tuples to lists is a practice data professionals use so they can make adjustments to the data, if necessary.

* Use a list comprehension to convert `state_county_tuples` from a list of tuples to a list of lists. Assign the result to a variable called `state_county_lists`.

* Print the result.

*Expected result:*

```
[OUT] [['Arizona', 'Maricopa'],
       ['California', 'Alameda'],
       ['California', 'Sacramento'],
       ['Kentucky', 'Jefferson'],
       ['Louisiana', 'East Baton Rouge']]
```

In [38]:
# 1. ### YOUR CODE HERE ###
state_list =["Arizona",'California', 'California','Kentucky','Louisiana']

# 2. ### YOUR CODE HERE ###
county_list=["Maricopa",'Alameda','Sacramento', 'Jefferson','East Baton Rouge']

##zip to list of tuple
zipped_places = zip(state_list, county_list)
list_zipped_places=list(zipped_places)

print(list_zipped_places)

#list of tuple to list of list
list_of_lists_places = [list(t) for t in list_zipped_places]
list_of_lists_places

[('Arizona', 'Maricopa'), ('California', 'Alameda'), ('California', 'Sacramento'), ('Kentucky', 'Jefferson'), ('Louisiana', 'East Baton Rouge')]

[['Arizona', 'Maricopa'],
 ['California', 'Alameda'],
 ['California', 'Sacramento'],
 ['Kentucky', 'Jefferson'],
 ['Louisiana', 'East Baton Rouge']]

<details><summary><h4>Hint 1</h4></summary>

Refer to what you've learned about list comprehension.

</details>

<details><summary><h4>Hint 2</h4></summary>

Remember that list comprehensions are like loops written in reverse:

`[{operation to perform} for {element} in {iterable}]`

</details>

<details><summary><h4>Hint 3</h4></summary>

There are multiple ways to perform this operation. The simplest uses the `list()` function on each element in `state_county_zipped`.

Another way is to use indexing to unpack each tuple into a list.

`[[i[0], i[1]] for i in state_county_tuples]`

</details>

## Task 3: Unpacking an iterable

Data professionals often use the technique of unpacking to work with individual elements of iterable objects. As you continue in your work as an analyst, you are asked to iterate through your list of state/county pairs to identify only the counties in California.

As a refresher, here is the data you have been working with:

| state_name | county_name |
| --- | --- |
| Arizona | Maricopa |
| California | Alameda |
| California | Sacramento |
| Kentucky | Jefferson |
| Louisiana | East Baton Rouge |

### 3a: Unpacking in a loop

* Write a loop that unpacks each tuple in `state_county_tuples` and, if the state in the tuple is `California`, add the corresponding county to a list called `ca_counties`.

*Expected output:*

```
[OUT] ['Alameda', 'Sacramento']
```

In [39]:
### YOUR CODE HERE ###
print(list_zipped_places)
ca_counties=[]
for state, county in list_zipped_places:
   if (state=='California'):
     ca_counties.append(county)
print(ca_counties)

[('Arizona', 'Maricopa'), ('California', 'Alameda'), ('California', 'Sacramento'), ('Kentucky', 'Jefferson'), ('Louisiana', 'East Baton Rouge')]
['Alameda', 'Sacramento']

<details><summary><h4>Hint 1</h4></summary>

Refer to what you learned about unpacking tuples, `for` loops, conditional statements, and `list` methods.

</details>

<details><summary><h4>Hint 2</h4></summary>

To unpack a tuple in a loop, you must assign each of its elements to a variable. Each tuple in `state_county_tuples` has two elements, so instead of writing `for a in x`, you must write `for a, b in x`.

</details>

<details><summary><h4>Hint 3</h4></summary>

* Instantiate the `ca_counties` list before you begin writing your loop.

* With each iteration of the loop:
    1. Unpack each tuple in `state_county_tuples`:
     ```
     for state, county in state_county_tuples:
     ```
    2. Check whether `state` is California:
    ```
    if state == 'California':
    ```
    3. If it is, append `county` to `ca_counties`:
    ```
    ca_counties.append(county)
    ```

</details>

### 3b: Unpacking in a list comprehension

Now, use a list comprehension to accomplish the same thing as what you did in Task 3a.

* In a list comprehension, unpack each tuple in `state_county_tuples` and, if the state in the tuple is `California`, add the corresponding county to the list comprehension.

* Assign the result to a variable called `ca_counties`.

* Print `ca_counties`.

*Expected output:*

```
[OUT] ['Alameda', 'Sacramento']
```

In [40]:
### YOUR CODE HERE ###
ca_counties=[]
for state, county in list_of_lists_places:
     if (state=='California'):
         ca_counties.append(county)
print(ca_counties)

['Alameda', 'Sacramento']

<details><summary><h4>Hint 1</h4></summary>

Refer to what you learned about list comprehension syntax. Also refer to previous tasks and examples in this lab.

</details>

<details><summary><h4>Hint 2</h4></summary>

It can be helpful to progress towards the goal in smaller steps. For example, first try to create a list comprehension that unpacks the `county` from each `state, county` pair, resulting in a list of *all* the counties.

If you can do that, then tweak the list comprehension by adding a conditional statement that only keeps the `county` if its corresponding `state` is `California`.

</details>

<details><summary><h4>Hint 3</h4></summary>

Consider the following syntax:

```
[___ for (___, ___) in _________ if __________]
```

</details>

## Conclusion

**What are your key takeaways from this lab?**

[Double-click to record your response here.]

**Congratulations!** You've completed this lab. However, you may not notice a green check mark next to this item on Coursera's platform. Please continue your progress regardless of the check mark. Just click on the "save" icon at the top of this notebook to ensure your work has been logged.

In [2]:
import pandas as pd
data = {'planet': ['Mercury', 'Venus', 'Earth', 'Mars',
                   'Jupiter', 'Saturn', 'Uranus', 'Neptune'],
       'radius_km': [2440, 6052, 6371, 3390, 69911, 58232,
                     25362, 24622],
       'moons': [0, 0, 1, 2, 80, 83, 27, 14]
        }
df = pd.DataFrame(data)
df

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
4  Jupiter      69911     80
5   Saturn      58232     83
6   Uranus      25362     27
7  Neptune      24622     14

In [3]:
print(df['moons'] < 20)

0     True
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: moons, dtype: bool

In [4]:
print(df[df['moons'] < 20])

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
7  Neptune      24622     14

In [8]:
mask = df['moons'] < 20
mask_df=df[mask]
print(mask_df)

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
7  Neptune      24622     14

In [11]:
mask = df['moons'] < 20
df2 = df[mask]
df2

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
7  Neptune      24622     14

In [13]:
mask = df['moons'] < 20
df.loc[mask, 'radius_km']

0     2440
1     6052
2     6371
3     3390
7    24622
Name: radius_km, dtype: int64

In [15]:
mask = (df['moons'] < 10) | (df['moons'] > 50)
df[mask]

    planet  radius_km  moons
0  Mercury       2440      0
1    Venus       6052      0
2    Earth       6371      1
3     Mars       3390      2
4  Jupiter      69911     80
5   Saturn      58232     83

In [17]:
mask = (df['moons'] > 20) & ~(df['moons'] == 80) & ~(df['radius_km'] < 50000) # ~ is NOT
df[mask]

   planet  radius_km  moons
5  Saturn      58232     83

In [18]:
mask = (df['moons'] > 20) & (df['moons'] != 80) & (df['radius_km'] >= 50000) # & is AND
df[mask]

   planet  radius_km  moons
5  Saturn      58232     83

In [19]:
clothes = pd.DataFrame({'type': ['pants', 'shirt', 'shirt', 'pants', 'shirt', 'pants'],
                       'color': ['red', 'blue', 'green', 'blue', 'green', 'red'],
                       'price_usd': [20, 35, 50, 40, 100, 75],
                       'mass_g': [125, 440, 680, 200, 395, 485]})


clothes

    type  color  price_usd  mass_g
0  pants    red         20     125
1  shirt   blue         35     440
2  shirt  green         50     680
3  pants   blue         40     200
4  shirt  green        100     395
5  pants    red         75     485

In [20]:
grouped = clothes.groupby('type')
print(grouped)
print(type(grouped))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000028C28B48D00>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [23]:
clothes.groupby(['type', 'color']).agg(['mean', 'max','size'])

            price_usd           mass_g
                 mean  max size   mean  max size
type  color
pants blue       40.0   40    1  200.0  200    1
      red        47.5   75    2  305.0  485    2
shirt blue       35.0   35    1  440.0  440    1
      green      75.0  100    2  537.5  680    2

In [26]:
clothes.agg({'price_usd': ['mean', 'median', 'sum'],
            'mass_g': ['mean', 'median']
            })

         price_usd  mass_g
mean     53.333333   387.5
median   45.000000   417.5
sum     320.000000     NaN

In [27]:
grouped = clothes.groupby(['color', 'type']).agg(['mean', 'min'])
grouped

            price_usd     mass_g
                 mean min   mean  min
color type
blue  pants      40.0  40  200.0  200
      shirt      35.0  35  440.0  440
green shirt      75.0  50  537.5  395
red   pants      47.5  20  305.0  125

In [28]:
grouped.index

MultiIndex([( 'blue', 'pants'),
            ( 'blue', 'shirt'),
            ('green', 'shirt'),
            (  'red', 'pants')],
           names=['color', 'type'])

In [29]:
grouped.columns

MultiIndex([('price_usd', 'mean'),
            ('price_usd',  'min'),
            (   'mass_g', 'mean'),
            (   'mass_g',  'min')],
           )

In [32]:
grouped.loc[:, 'mass_g']

              mean  min
color type
blue  pants  200.0  200
      shirt  440.0  440
green shirt  537.5  395
red   pants  305.0  125

In [31]:
grouped

            price_usd     mass_g
                 mean min   mean  min
color type
blue  pants      40.0  40  200.0  200
      shirt      35.0  35  440.0  440
green shirt      75.0  50  537.5  395
red   pants      47.5  20  305.0  125

In [33]:
grouped.loc[:, ('price_usd', 'min')]

color  type
blue   pants    40
       shirt    35
green  shirt    50
red    pants    20
Name: (price_usd, min), dtype: int64

In [35]:
grouped.loc[('blue', 'pants'), :]

price_usd  mean     40.0
           min      40.0
mass_g     mean    200.0
           min     200.0
Name: (blue, pants), dtype: float64

In [38]:
grouped.loc[('blue', 'shirt'), ('price_usd', 'mean')] #selecting individual values

35.0